app/Controllers/UserController.php

    public function store()
    {
        $data = $this->request->getPost();
        $entity = new User();
        $entity->fill($data);

        if (!$this->model->insert($entity)) {
---
INSERT INTO `user` (`nom`, `prenom`, `telephone`, `mail`, `admin`) VALUES ('DINE', 'JRIDI', '0624221008', 'dinejridi@gmail.com', 0)